app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC  [["post_id", 27]]
---
	def index
		@comments = @post.comments.order(created_at: :asc)

INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "qwe"], ["user_id", 3], ["post_id", 27], ["created_at", "2022-03-27 02:41:22.219126"], ["updated_at", "2022-03-27 02:41:22.219126"]]
---
	def create
		params[:comment][:user_id] = 3
		@comment = @post.comments.new(comment_params)
		if @comment.save!