app/controllers/posts_controller.rb

    def index
      @posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

    def create
      @post = Post.new(post_params)
      @post.user = current_user

      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdbv"], ["body", "sdfbd123"], ["user_id", 3], ["created_at", "2022-03-26 13:59:42.363010"], ["updated_at", "2022-03-26 13:59:42.363010"]]

    def destroy
      if @post.delete!(current_user)
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 24]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]